Autodesk.Revit.DB.Architecture.FasciaTypeSet
A set that contains fascia types.

Autodesk.Revit.DB.Architecture.FasciaTypeSet.Insert(Autodesk.Revit.DB.Architecture.FasciaType)
System.Int32
Insert the specified fascia type into the set.
item: The fascia type to be inserted into the set.
Returns: Returns whether the fascia type was inserted into the set.

Autodesk.Revit.DB.Architecture.FasciaTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Architecture.FasciaTypeSet.ReverseIterator
Autodesk.Revit.DB.Architecture.FasciaTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Architecture.FasciaTypeSet.ForwardIterator
Autodesk.Revit.DB.Architecture.FasciaTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Architecture.FasciaTypeSet.Erase(Autodesk.Revit.DB.Architecture.FasciaType)
System.Int32
Removes a specified fascia type from the set.
item: The fascia type to be erased.
Returns: The number of fascia types that were erased from the set.

Autodesk.Revit.DB.Architecture.FasciaTypeSet.Contains(Autodesk.Revit.DB.Architecture.FasciaType)
System.Boolean
Tests for the existence of a fascia type within the set.
item: The fascia type to be searched for.
Returns: The Contains method returns True if the fascia type is within the set, otherwise False.

Autodesk.Revit.DB.Architecture.FasciaTypeSet.Clear
void
Removes every fascia type from the set, rendering it empty.

Autodesk.Revit.DB.Architecture.FasciaTypeSet.Size
System.Int32
get
Returns the number of fascia types that are in the set.

Autodesk.Revit.DB.Architecture.FasciaTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.